pellepl/baremetal/arch/msp/msp430/mdk/include/cc430f5143.h
/* CBIV Definitions */
#define CBIV_NONE              (0x0000)       /* No Interrupt pending */
#define CBIV_CBIFG             (0x0002)       /* CBIFG */
#define CBIV_CBIIFG            (0x0004)       /* CBIIFG */

/************************************************************
* CC1101 Radio Interface
************************************************************/
#define __MSP430_HAS_CC1101__                 /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CC1101__ 0x0F00
#define RF1A_BASE              __MSP430_BASEADDRESS_CC1101__

sfr_w(RF1AIFCTL0);                            /* Radio interface control register 0 */
sfr_b(RF1AIFCTL0_L);                          /* Radio interface control register 0 */
sfr_b(RF1AIFCTL0_H);                          /* Radio interface control register 0 */
sfr_w(RF1AIFCTL1);                            /* Radio interface control register 1 */
sfr_b(RF1AIFCTL1_L);                          /* Radio interface control register 1 */
sfr_b(RF1AIFCTL1_H);                          /* Radio interface control register 1 */
#define  RF1AIFIFG             RF1AIFCTL1_L   /* Radio interface interrupt flag register */
#define  RF1AIFIE              RF1AIFCTL1_H   /* Radio interface interrupt enable register */
sfr_w(RF1AIFCTL2);                            /* (Radio interface control register 2) */
sfr_b(RF1AIFCTL2_L);                          /* (Radio interface control register 2) */
sfr_b(RF1AIFCTL2_H);                          /* (Radio interface control register 2) */
sfr_w(RF1AIFERR);                             /* Radio interface error flag register */
sfr_b(RF1AIFERR_L);                           /* Radio interface error flag register */
sfr_b(RF1AIFERR_H);                           /* Radio interface error flag register */
sfr_w(RF1AIFERRV);                            /* Radio interface error vector word register */
sfr_b(RF1AIFERRV_L);                          /* Radio interface error vector word register */
sfr_b(RF1AIFERRV_H);                          /* Radio interface error vector word register */
sfr_w(RF1AIFIV);                              /* Radio interface interrupt vector word register */
sfr_b(RF1AIFIV_L);                            /* Radio interface interrupt vector word register */
sfr_b(RF1AIFIV_H);                            /* Radio interface interrupt vector word register */
sfr_w(RF1AINSTRW);                            /* Radio instruction word register */
sfr_b(RF1AINSTRW_L);                          /* Radio instruction word register */
sfr_b(RF1AINSTRW_H);                          /* Radio instruction word register */
#define  RF1ADINB              RF1AINSTRW_L   /* Radio instruction byte register */
#define  RF1AINSTRB            RF1AINSTRW_H   /* Radio byte data in register */
sfr_w(RF1AINSTR1W);                           /* Radio instruction 1-byte register with autoread */
sfr_b(RF1AINSTR1W_L);                         /* Radio instruction 1-byte register with autoread */
sfr_b(RF1AINSTR1W_H);                         /* Radio instruction 1-byte register with autoread */
#define  RF1AINSTR1B           RF1AINSTR1W_H  /* Radio instruction 1-byte register with autoread */
sfr_w(RF1AINSTR2W);                           /* Radio instruction 2-byte register with autoread */
sfr_b(RF1AINSTR2W_L);                         /* Radio instruction 2-byte register with autoread */
sfr_b(RF1AINSTR2W_H);                         /* Radio instruction 2-byte register with autoread */
#define  RF1AINSTR2B           RF1AINSTR1W_H  /* Radio instruction 2-byte register with autoread */
sfr_w(RF1ADINW);                              /* Radio word data in register */
sfr_b(RF1ADINW_L);                            /* Radio word data in register */
sfr_b(RF1ADINW_H);                            /* Radio word data in register */

sfr_w(RF1ASTAT0W);                            /* Radio status word register without auto-read */
sfr_b(RF1ASTAT0W_L);                          /* Radio status word register without auto-read */
sfr_b(RF1ASTAT0W_H);                          /* Radio status word register without auto-read */
#define  RF1ADOUT0B            RF1ASTAT0W_L   /* Radio byte data out register without auto-read */
#define  RF1ASTAT0B            RF1ASTAT0W_H   /* Radio status byte register without auto-read */
#define  RF1ASTATW             RF1ASTAT0W     /* Radio status word register without auto-read */
#define  RF1ADOUTB             RF1ASTAT0W_L   /* Radio byte data out register without auto-read */
#define  RF1ASTATB             RF1ASTAT0W_H   /* Radio status byte register without auto-read */
sfr_w(RF1ASTAT1W);                            /* Radio status word register with 1-byte auto-read */
sfr_b(RF1ASTAT1W_L);                          /* Radio status word register with 1-byte auto-read */
sfr_b(RF1ASTAT1W_H);                          /* Radio status word register with 1-byte auto-read */
#define  RF1ADOUT1B            RF1ASTAT1W_L   /* Radio byte data out register with 1-byte auto-read */
#define  RF1ASTAT1B            RF1ASTAT1W_H   /* Radio status byte register with 1-byte auto-read */
sfr_w(RF1ASTAT2W);                            /* Radio status word register with 2-byte auto-read */
sfr_b(RF1ASTAT2W_L);                          /* Radio status word register with 2-byte auto-read */
sfr_b(RF1ASTAT2W_H);                          /* Radio status word register with 2-byte auto-read */
#define  RF1ADOUT2B            RF1ASTAT2W_L   /* Radio byte data out register with 2-byte auto-read */
#define  RF1ASTAT2B            RF1ASTAT2W_H   /* Radio status byte register with 2-byte auto-read */
sfr_w(RF1ADOUT0W);                            /* Radio core word data out register without auto-read */
sfr_b(RF1ADOUT0W_L);                          /* Radio core word data out register without auto-read */
sfr_b(RF1ADOUT0W_H);                          /* Radio core word data out register without auto-read */
#define  RF1ADOUTW             RF1ADOUT0W     /* Radio core word data out register without auto-read */
#define  RF1ADOUTW_L           RF1ADOUT0W_L   /* Radio core word data out register without auto-read */
#define  RF1ADOUTW_H           RF1ADOUT0W_H   /* Radio core word data out register without auto-read */
sfr_w(RF1ADOUT1W);                            /* Radio core word data out register with 1-byte auto-read */
sfr_b(RF1ADOUT1W_L);                          /* Radio core word data out register with 1-byte auto-read */
sfr_b(RF1ADOUT1W_H);                          /* Radio core word data out register with 1-byte auto-read */
sfr_w(RF1ADOUT2W);                            /* Radio core word data out register with 2-byte auto-read */
sfr_b(RF1ADOUT2W_L);                          /* Radio core word data out register with 2-byte auto-read */
sfr_b(RF1ADOUT2W_H);                          /* Radio core word data out register with 2-byte auto-read */
sfr_w(RF1AIN);                                /* Radio core signal input register */
sfr_b(RF1AIN_L);                              /* Radio core signal input register */
sfr_b(RF1AIN_H);                              /* Radio core signal input register */
sfr_w(RF1AIFG);                               /* Radio core interrupt flag register */
sfr_b(RF1AIFG_L);                             /* Radio core interrupt flag register */
sfr_b(RF1AIFG_H);                             /* Radio core interrupt flag register */
sfr_w(RF1AIES);                               /* Radio core interrupt edge select register */
sfr_b(RF1AIES_L);                             /* Radio core interrupt edge select register */
sfr_b(RF1AIES_H);                             /* Radio core interrupt edge select register */
sfr_w(RF1AIE);                                /* Radio core interrupt enable register */
sfr_b(RF1AIE_L);                              /* Radio core interrupt enable register */
sfr_b(RF1AIE_H);                              /* Radio core interrupt enable register */
sfr_w(RF1AIV);                                /* Radio core interrupt vector word register */
sfr_b(RF1AIV_L);                              /* Radio core interrupt vector word register */
sfr_b(RF1AIV_H);                              /* Radio core interrupt vector word register */
sfr_w(RF1ARXFIFO);                            /* Direct receive FIFO access register */
sfr_b(RF1ARXFIFO_L);                          /* Direct receive FIFO access register */
sfr_b(RF1ARXFIFO_H);                          /* Direct receive FIFO access register */
sfr_w(RF1ATXFIFO);                            /* Direct transmit FIFO access register */
sfr_b(RF1ATXFIFO_L);                          /* Direct transmit FIFO access register */
sfr_b(RF1ATXFIFO_H);                          /* Direct transmit FIFO access register */

